## This  DataFrame will be used  for practice:

In [51]:
import pandas as pb

In [62]:
data = {
    'Name': ['Nikunj','Rohan','Azad','Mayank','Jayant'],
     'Age' : [21,32,43,54,65] ,
    'Score': [12,23,34,45,56]
}
df = pd.DataFrame(data)

## 1. Select Columns

In [53]:
df['Name']                     #df.Name can also be used 
df[['Name','Age']]

     Name  Age
0  Nikunj   21
1   Rohan   32
2    Azad   43
3  Mayank   54
4  Jayant   65

##  2. Select Rows by Index – .iloc[]

In [54]:
df.iloc[0]
df.iloc[1:5]

     Name  Age  Score
1   Rohan   32     23
2    Azad   43     34
3  Mayank   54     45
4  Jayant   65     56

## 3. Select Rows by Label – .loc[]

In [63]:
df = df.set_index('Name')
df.loc['Nikunj']

Age      21
Score    12
Name: Nikunj, dtype: int64

##  4. Filter Rows by Condition

In [57]:
df[df["Score"]>55]

        Age  Score
Name
Jayant   65     56

In [64]:
df[(df['Score'] > 15) & (df['Age'] < 35)]

       Age  Score
Name
Rohan   32     23

##  5. Sort by Column – .sort_values()

In [66]:
df.sort_values(by='Score')            
df.sort_values(by='Score', ascending=False)

        Age  Score
Name
Jayant   65     56
Mayank   54     45
Azad     43     34
Rohan    32     23
Nikunj   21     12

## 6. Sort by Index – .sort_index()

In [67]:
df.sort_index()

        Age  Score
Name
Azad     43     34
Jayant   65     56
Mayank   54     45
Nikunj   21     12
Rohan    32     23